#### WallFunction Enumeration

---

|  |
| --- |
| See Also |

Indicates the function of a specified WallType, as specified in the parameter FUNCTION\_PARAM on the WallType.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum WallFunction ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WallFunction ``` |

| Visual C++ |
| --- |
| ``` public enum class WallFunction ``` |

# Members

| Member name | Description |
| --- | --- |
| Interior | An interior wall. |
| Exterior | An exterior wall. |
| Foundation | A foundation wall. |
| Retaining | A retaining wall. |
| Soffit | A soffit wall. |
| Coreshaft | A coreshaft wall. |

# See Also

Autodesk.Revit.DB Namespace